/// 単位のカテゴリー
enum Units {
  length, // 長さ
}

/// データを取得する
extension GetData on Units {
  List<List<String>> get data {
    switch (this) {
      case Units.length:
        return _length;
    }
  }
}

extension GetUnitName on Units {
  String get name {
    switch (this) {
      case Units.length:
        return '長さ';
    }
  }
}

/// カラムの定義
enum UnitsColumn {
  constant(0), // 換算係数
  abbreviation(1), // 略称
  displayName(2), // 表示名
  ;

  final int v;
  const UnitsColumn(this.v);
}

/// 長さの単位データ
/// [換算係数, 略称, 表示名]
const List<List<String>> _length = [
  ['1', 'm', 'メートル'],
  ['1e-15', 'fm', 'フェルミ'],
  ['1e-10', 'Å', 'オングストローム'],
  ['1e4', '-', 'スカンジナビアマイル'],
  ['1.0021e-13', 'xu', 'X線単位'],
  ['1.00207697e-13', 'xu', '銅X線単位'],
  ['1.00209952e-13', 'xu', 'モリブデンX線単位'],
  ['1852', 'nm', '海里'],
  ['185.2', 'cbl', 'ケーブル'],
  ['1.852', 'fth', 'ファゾム'],
  ['1143/1250', 'yd', 'ヤード'],
  ['381/1250', 'ft', 'フィート'],
  ['127/1250', 'hh', 'ハンド'],
  ['127/5000', 'in', 'インチ'],
  ['127/15000', 'bc', 'バーリーコーン'],
  ['127/5000000', 'thou', 'サウ'],
  ['127/7200000', 'twip', 'twip'],
  ['12573/625', 'ch', 'チェーン'],
  ['25146/125', 'fur', 'ハロン'],
  ['201168/125', 'mi', 'マイル'],
  ['603504/125', 'lea', 'リーグ'],
  ['5556', 'lea', '航海リーグ'],
  ['4000', 'lea', 'メートルリーグ'],
  ['12573/62500', 'lk', 'リンク'],
  ['0.2268', 'lk', 'スコットリンク'],
  ['12573/2500', 'rd', 'ロッド'],
  ['381/20000', 'dg', 'ディジット'],
  ['1143/20000', 'nil', 'ネイル'],
  ['889/40000', 'fgr', 'フィンガー'],
  ['1.143', 'ell', 'エル'],
  ['3429/5000', 'ell', 'エル(フランドル)'],
  ['3429/2500', 'ell', 'エル(フランス)'],
  ['381/5000', 'plm', 'パーム'],
  ['381/2500', 'sft', 'シャフトメント'],
  ['1143/5000', 'sp', 'スパン'],
  ['1143/2500', 'cb', 'キュービット'],
  ['1200/3937', 'ft', '米測量フィート'],
  ['0.3047996', 'ft', '印測量フィート'],
  ['10/33', '-', '曲尺'],
  ['25/66', '-', '鯨尺'],
  ['1/33', '-', '寸'],
  ['8/330', '-', '文'],
  ['1/330', '-', '分'],
  ['1/3300', '-', '厘'],
  ['1/33000', '-', '毛'],
  ['20/11', '-', '江戸間'],
  ['65/33', '-', '京間'],
  ['1200/11', '-', '町'],
  ['43200/11', '-', '里'],
  ['3.0856775814671916E+16', 'pc', 'パーセク'],
  ['1.616255e-35', 'pl', 'プランク長'],
  ['8.4075e-16', '?', '陽子半径'],
  ['5.29177210544e-11', '?', 'ボーア半径'],
  ['1e-18', '?', 'LIGOの精度'],
  ['2.8179403205e-15', '?', '古典電子半径'],
  ['3.5668e-10', '?', 'ダイヤの単位構造'],
  ['1e-9', '?', 'フラーレン'],
  ['1e-7', '?', '金箔'],
  ['3.5e-7', '?', 'タバコの煙の粒子'],
  ['3e-6', '?', 'CPUのトランジスタ'],
  ['1.3e-5', '?', '合成繊維'],
  ['8e-5', '?', 'ヒトの毛'],
  ['1e-4', '?', 'ヒトの分解能'],
  ['1.5e-3', '?', 'カップ麺の太さ'],
  ['5e-3', '?', '日本のアリ'],
  ['8.7e-3', '?', 'ハードコンタクトレンズ'],
  ['1.4e-2', '?', 'ソフトコンタクトレンズ'],
  ['1.5e-2', '?', '平均的な蚊'],
  ['3.8e-2', '?', 'トイレットペーパーの芯の太さ'],
  ['4e-2', '?', 'ピンポン玉'],
  ['5.4e-2', '?', '運転免許証の短辺'],
  ['5.5e-2', '?', '消しゴムの長辺'],
  ['7.6e-2', '?', '紙幣の短辺'],
  ['8e-2', '?', '広辞苑の厚さ'],
  ['8.56e-2', '?', 'クレカの長辺'],
  ['8.6e-2', '?', 'テレカの長辺'],
  ['1e-1', '?', 'はがきの短辺'],
  ['1.0671e-1', '?', 'カップヌードルの高さ'],
  ['1.2e-1', '?', 'CD､DVDの直径'],
  ['1.28e-1', '?', 'パスポートの長辺'],
  ['1.5e-1', '?', 'スズメ'],
  ['1.75e-1', '?', '鉛筆'],
  ['2.1e-1', '?', 'A4用紙の長辺'],
  ['2.5e-1', '?', '歩行者用信号機のライト'],
  ['3e-1', ' ?', '点字ブロック'],
  ['5.304e-1', ' ?', '24インチモニターの長辺'],
  ['5.45e-1', ' ?', '新聞紙の長辺'],
  ['7e-1', ' ?', 'カラーコンの高さ'],
  ['8e-1', '?', 'ラバーポールの高さ'],
  ['1.8', ' ?', '百葉箱の高さ'],
  ['1.83', '?', '自動販売機'],
  ['2.44', '?', 'サッカーゴール'],
  ['2.74', ' ?', '卓球台の高さ'],
  ['3', '?', '横断歩道線'],
  ['3', '?', 'マンション1階分'],
  ['4.2', '?', 'キリン'],
  ['4.8', '?', 'タクシー'],
  ['5', '?', '一般道の白線'],
  ['8', '?', '高速道路の白線'],
  ['15', '?', 'ナイアガラの滝の幅'],
  ['18', '?', '清水寺の本堂'],
  ['22', '?', 'エッフェル塔(佐賀)'],
  ['23.72', '?', 'ボウリングレーン'],
  ['27.431', '?', '野球の塁間'],
  ['30', '?', 'トイレットペーパー'],
  ['39.5', '?', '飛行機'],
  ['47.35', '?', '国立競技場の高さ'],
  ['93', '?', '自由の女神'],
  ['200', '?', '東京ドームの直径'],
  ['312', '？', 'エッフェル塔'],
  ['333', '？', '東京タワー'],
  ['634', '？', '東京スカイツリー'],
  ['3776.24', '？', '富士山'],
  ['5000', ' ?', '地平線までの距離'],
  ['20000', '？', '成層圏'],
  ['1.00E+05', '？', '宇宙までの距離'],
  ['4.00E+05', '？', 'ISS'],
  ['1.25E+06', '？', '本州の最長距離'],
  ['3144175.04', '？', '日本の東西距離'],
  ['1.50E+07', '？', 'ユーラシア大陸'],
  ['4.00E+07', '？', '赤道一周'],
  ['1.00E+08', '？', 'ヒトの血管全長'],
  ['3.80E+08', '？', '月までの距離'],
  ['6.96E+08', '？', '太陽の半径'],
  ['1.20E+09', '？', '海底ケーブル全長'],
  ['1.80E+13', '？', '太陽圏の半径'],
  ['1.76915659837261e+16', '？', 'オールトの雲までの距離'],
  ['2.554397227596816e+20', '？', '天の川銀河中心部までの距離'],
  ['2.081360703967776e+21', '？', '天の川銀河直径'],
  ['2.3651826181452e+22', '？', 'アンドロメダ銀河までの距離'],
  ['1.89214609451616e+24', '？', 'おとめ座超銀河団'],
  ['8.798479339500144e+26', '？', '観測可能な宇宙の直径'],
];
